In [34]:
import pandas as pd
import csv
import datetime
colnames = ['BOROUGH','VEHICLE 1 TYPE', 'VEHICLE 2 TYPE', 'VEHICLE 3 TYPE']
df1=pd.read_csv(r'C:\Users\smrut\Documents\Python\PythonAssignment3\Assignment 3\Data\vehicle_collisions.csv',sep=",",usecols=(3,19,20,21,22,23))
df1.head()

,BOROUGH,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE,VEHICLE 5 TYPE
0,QUEENS,SPORT UTILITY/STATION WAGON,NaN,NaN,NaN,NaN
1,NaN,PASSENGER VEHICLE,NaN,NaN,NaN,NaN
2,BROOKLYN,PASSENGER VEHICLE,UNKNOWN,NaN,NaN,NaN
3,BROOKLYN,BUS,PASSENGER VEHICLE,NaN,NaN,NaN
4,NaN,UNKNOWN,PASSENGER VEHICLE,NaN,NaN,NaN

In [9]:
for rows in df1.iterrows:
    
#df1[['VEHICLE 1 TYPE', 'VEHICLE 2 TYPE', 'VEHICLE 3 TYPE', 'VEHICLE 4 TYPE' , 'VEHICLE 5 TYPE']].groupby(df1['BOROUGH']).agg(['count'])

,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE,VEHICLE 5 TYPE
,count,count,count,count,count
BOROUGH,,,,,
BRONX,45599,36972,2587,625,173
BROOKLYN,104174,86799,6592,1612,461
MANHATTAN,82801,69483,2525,501,129
QUEENS,89140,76178,5918,1420,314
STATEN ISLAND,13943,11600,924,165,32

In [32]:
import numpy as np
colvals = np.array(['AMBULANCE', 'BICYCLE', 'BUS', 'FIRETRUCK', 'LARGE COM VEH(6 OR MORE TYRES)', 'LIVERY VEHICLE','MOTORCYCLE','OTHERS','PASSENGER VEHICLE','PICK_UP TRUCK','SCOOTER','SMALL COM VEH(4 TYRES)','SPORT UTILITY?STATION WAGON','TAXI','UNKNOWN','VAN'])
for col in df1:
 
 for colvals in df1:
        for num in colvals:
            if num in colvals:
                df1['1 Vechicle Included']=  df1.groupby('BOROUGH') +1

df1.head()

NameError: name 'count' is not defined

In [61]:
#df1.set_index('VEHICLE 1 TYPE','VEHICLE 2 TYPE', 'VEHICLE 3 TYPE','VEHICLE 4 TYPE','VEHICLE 5 TYPE').T)
#df1.head()
df2=df1.transpose()
df2.head()
df.groupby(['BOROUGH']).get_group(('bar', 'one'))

NameError: name 'df' is not defined

In [62]:
df1.head()
#df1['1 VEHICLE INVOLVED']=df1['VEHICLE 1 TYPE','VEHICLE 2 TYPE','VEHICLE 3 TYPE','VEHICLE 4 TYPE','VEHICLE 5 TYPE'].groupby(['BOROUGH',axis=1]).
dfblah=df1.groupby(['BOROUGH']).
dfblah.head()

SyntaxError: invalid syntax (<ipython-input-62-bae1c5590690>, line 3)

In [68]:
from collections import Counter
#df1['1 Vehicle Involved']=df1[["VEHICLE 1 TYPE","VEHICLE 2 TYPE","VEHICLE 3 TYPE","VEHICLE 4 TYPE","VEHICLE 5 TYPE"]].apply(lambda row: df(row[], row[c]), axis=1)
df1['11 VEHCILE INVOLVED']=df1.apply(lambda row: df1(row[VEHICLE 1 TYPE], row[VEHICLE 2 TYPE]), axis=1)
df1.head()

,BOROUGH,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE,VEHICLE 5 TYPE,1 Vehicle Involved
0,QUEENS,SPORT UTILITY/STATION WAGON,NaN,NaN,NaN,NaN,NaN
1,NaN,PASSENGER VEHICLE,NaN,NaN,NaN,NaN,NaN
2,BROOKLYN,PASSENGER VEHICLE,UNKNOWN,NaN,NaN,NaN,NaN
3,BROOKLYN,BUS,PASSENGER VEHICLE,NaN,NaN,NaN,NaN
4,NaN,UNKNOWN,PASSENGER VEHICLE,NaN,NaN,NaN,NaN